Revit 2027 API
Macro Properties
The Macro type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MacroModule |  The Macro module.
Name |  The macro name.
Top
See Also
Reference
Macro Class
Autodesk.Revit.DB.Macros Namespace